{
	"HomePage": {
		"title": "โปรเจกต์และประสบการณ์"
	},
	"silverbullet": {
		"title": "Silver Bullet",
		"description": "ฉันได้ทำงานเกี่ยวกับ Silver Bullet มาตั้งแต่ปี 2021 ซึ่งต่อมาได้กลายเป็นวิทยานิพนธ์ระดับปริญญาตรีของฉัน ในระหว่างการมีส่วนร่วมในโปรเจกต์นี้ ฉันได้เรียนรู้และพัฒนาพื้นฐานมากมายเพื่อการบำรุงรักษาและการนำกลับมาใช้ใหม่ที่ดีขึ้น ฉันมีโอกาสได้เรียนรู้เกี่ยวกับหลักการ SOLID, DRY, การแยกส่วนโค้ดผ่าน DDD และ OOP และ TDD เพื่อให้มั่นใจว่าทุกอย่างทำงานได้ตามที่คาดหวัง"
	},
	"unipampa": {
		"title": "ปริญญาตรีสาขาวิศวกรรมซอฟต์แวร์",
		"description": "ในระหว่างที่เรียนปริญญาตรี โดยใช้วิธีการ PBL ฉันได้เรียนรู้เกี่ยวกับวงจรการพัฒนาซอฟต์แวร์ทั้งหมด ฉันสนใจในการสร้างแบบจำลองฐานข้อมูล โดยเฉพาะฐานข้อมูลเชิงสัมพันธ์ กระบวนการคุณภาพซอฟต์แวร์ ความปลอดภัย และสถาปัตยกรรมซอฟต์แวร์ ผ่าน PBL พวกเราได้นำสิ่งที่เรียนรู้มาประยุกต์ใช้โดยการรวบรวมความต้องการสำหรับองค์กรไม่แสวงหาผลกำไร การแก้ไขข้อผิดพลาดของโค้ดเก่า และการพัฒนาโปรเจกต์โดยใช้ OOP ด้วย JAVA ฉันยังได้เรียนรู้เกี่ยวกับกระบวนทัศน์อื่นๆ: C, Haskell, Python, Pascal และ PHP ฉันดูแลโปรเจกต์ไมโครเซอร์วิส ซึ่งพวกเราได้เรียนรู้เกี่ยวกับการรับส่งข้อความ พวกเราพัฒนาผลิตภัณฑ์สำหรับมหาวิทยาลัยอื่น โดยเรียนรู้เกี่ยวกับการบริหารจัดการโปรเจกต์ (แนวทาง PMBOK) และฉันทำหน้าที่เป็น PO เพื่อตรวจสอบความถูกต้อง ในภาคการศึกษาที่สอง ฉันได้เข้าร่วมโครงการวิจัยพร้อมทุนการศึกษา Silver Bullet ซึ่งต่อมาได้กลายเป็นวิทยานิพนธ์ระดับปริญญาตรีของฉัน"
	},
	"teasy": {
		"title": "Teasy Solutions",
		"description": "ที่ Teasy Solutions ซึ่งเป็นประสบการณ์การทำงานครั้งแรกของฉันเป็นเวลาเกือบสามปี ฉันได้สำรวจเทคโนโลยีต่างๆ มากมาย ฉันพัฒนา Serverless APIs บน AWS และเพิ่มพูนความรู้เกี่ยวกับ Docker ฉันศึกษาเทคโนโลยีใหม่ๆ เช่น Meta API และ Twilio API สำหรับโปรเจกต์ที่จะมาถึง และประยุกต์ใช้ทักษะการแก้ปัญหาของฉันโดยการสร้างแอปพลิเคชันเครื่องชำระเงินที่ทำงานร่วมกับระบบ Fiserv ในช่วงเวลานี้ ฉันได้สัมผัสกับ JavaScript และ Dart เป็นครั้งแรก และยังได้ใช้ Java นอกเหนือจากการทำงานในโปรเจกต์ด้วย WebSocket และฐานข้อมูลเชิงสัมพันธ์และไม่ใช่เชิงสัมพันธ์"
	},
	"whoami": {
		"position": "นักพัฒนาแบ็กเอนด์",
		"fields": "สาขาที่ฉันใฝ่ฝันอยากทำงานในอนาคต: CTO และสถาปนิกซอฟต์แวร์",
		"logo-title": "ทำไมถึงเป็นโลโก้ตัวสลอธ?",
		"story": "การสร้างไปป์ไลน์การพัฒนาที่ดีเป็นพื้นฐานสำคัญในการรับประกันคุณภาพ สำหรับฉันแล้ว กระบวนการที่ดีในระยะยาวคือวิธีที่ดีที่สุดในการประหยัดเวลา มุ่งเน้นไปที่การแก้ปัญหาที่แท้จริง และมีความมั่นใจในการส่งมอบผลิตภัณฑ์ที่น่าเชื่อถือและมีคุณภาพสูง โลโก้คือจุดเริ่มต้นของสิ่งที่ฉันหวังว่าสักวันหนึ่งจะกลายเป็นบริษัทของตัวเอง"
	},
	"read": {
		"more": "ดูเพิ่มเติม"
	}
}
